garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="SCANPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="SCANPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x3F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANPR" edc:mask="0x7" edc:name="SCANPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANPR0" edc:mask="0x1" edc:name="SCANPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANPR1" edc:mask="0x1" edc:name="SCANPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANPR2" edc:mask="0x1" edc:name="SCANPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMASELECT" edc:desc="DMA instance selection register" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="DMASELECT" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLCT" edc:mask="0x7" edc:name="SLCT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLCT0" edc:mask="0x1" edc:name="SLCT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT1" edc:mask="0x1" edc:name="SLCT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT2" edc:mask="0x1" edc:name="SLCT2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnBUF" edc:desc="DMA data buffer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="DMAnBUF" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUF" edc:mask="0xff" edc:name="BUF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BUF0" edc:mask="0x1" edc:name="BUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF1" edc:mask="0x1" edc:name="BUF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF2" edc:mask="0x1" edc:name="BUF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF3" edc:mask="0x1" edc:name="BUF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF4" edc:mask="0x1" edc:name="BUF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF5" edc:mask="0x1" edc:name="BUF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF6" edc:mask="0x1" edc:name="BUF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF7" edc:mask="0x1" edc:name="BUF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnDCNT" edc:desc="DMA destination count register" edc:name="DMAnDCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x42">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnDCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnDCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x42">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DCNT" edc:mask="0xff" edc:name="DCNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DCNT0" edc:mask="0x1" edc:name="DCNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT1" edc:mask="0x1" edc:name="DCNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT2" edc:mask="0x1" edc:name="DCNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT3" edc:mask="0x1" edc:name="DCNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT4" edc:mask="0x1" edc:name="DCNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT5" edc:mask="0x1" edc:name="DCNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT6" edc:mask="0x1" edc:name="DCNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT7" edc:mask="0x1" edc:name="DCNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnDCNTH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnDCNTH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x43">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DCNT" edc:mask="0xf" edc:name="DCNT" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DCNT8" edc:mask="0x1" edc:name="DCNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT9" edc:mask="0x1" edc:name="DCNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT10" edc:mask="0x1" edc:name="DCNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT11" edc:mask="0x1" edc:name="DCNT11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
