garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="DMAnSSAU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="DMAnSSAU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x53">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0x3f" edc:name="SSA" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA16" edc:mask="0x1" edc:name="SSA16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA17" edc:mask="0x1" edc:name="SSA17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA18" edc:mask="0x1" edc:name="SSA18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA19" edc:mask="0x1" edc:name="SSA19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA20" edc:mask="0x1" edc:name="SSA20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA21" edc:mask="0x1" edc:name="SSA21" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnn--n-r" edc:cname="DMAnCON0" edc:desc="DMA control register 0" edc:impl="0xe5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--0-0" edc:name="DMAnCON0" edc:nzwidth="8" edc:por="000--0-0" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x54">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XIP" edc:mask="0x1" edc:name="XIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQEN" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DGO" edc:mask="0x1" edc:name="DGO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQEN" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnCON1" edc:desc="DMA control register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x55">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSTP" edc:mask="0x1" edc:name="SSTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMODE" edc:mask="0x3" edc:name="SMODE" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SMR" edc:mask="0x3" edc:name="SMR" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DSTP" edc:mask="0x1" edc:name="DSTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMODE" edc:mask="0x3" edc:name="DMODE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnAIRQ" edc:desc="DMA abort trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnAIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x56">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AIRQ" edc:mask="0xff" edc:name="AIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AIRQ0" edc:mask="0x1" edc:name="AIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ1" edc:mask="0x1" edc:name="AIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ2" edc:mask="0x1" edc:name="AIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ3" edc:mask="0x1" edc:name="AIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ4" edc:mask="0x1" edc:name="AIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ5" edc:mask="0x1" edc:name="AIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ6" edc:mask="0x1" edc:name="AIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ7" edc:mask="0x1" edc:name="AIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSIRQ" edc:desc="DMA start trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x57">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIRQ" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SIRQ0" edc:mask="0x1" edc:name="SIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ1" edc:mask="0x1" edc:name="SIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ2" edc:mask="0x1" edc:name="SIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ3" edc:mask="0x1" edc:name="SIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ4" edc:mask="0x1" edc:name="SIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ5" edc:mask="0x1" edc:name="SIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ6" edc:mask="0x1" edc:name="SIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ7" edc:mask="0x1" edc:name="SIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
