garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x135">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRH0" edc:mask="0x1" edc:name="PRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH1" edc:mask="0x1" edc:name="PRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH2" edc:mask="0x1" edc:name="PRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH3" edc:mask="0x1" edc:name="PRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH4" edc:mask="0x1" edc:name="PRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH5" edc:mask="0x1" edc:name="PRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH6" edc:mask="0x1" edc:name="PRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH7" edc:mask="0x1" edc:name="PRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16APRH0" edc:mask="0x1" edc:name="TU16APRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH1" edc:mask="0x1" edc:name="TU16APRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH2" edc:mask="0x1" edc:name="TU16APRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH3" edc:mask="0x1" edc:name="TU16APRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH4" edc:mask="0x1" edc:name="TU16APRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH5" edc:mask="0x1" edc:name="TU16APRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH6" edc:mask="0x1" edc:name="TU16APRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH7" edc:mask="0x1" edc:name="TU16APRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16APR8" edc:mask="0x1" edc:name="TU16APR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR9" edc:mask="0x1" edc:name="TU16APR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR10" edc:mask="0x1" edc:name="TU16APR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR11" edc:mask="0x1" edc:name="TU16APR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR12" edc:mask="0x1" edc:name="TU16APR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR13" edc:mask="0x1" edc:name="TU16APR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR14" edc:mask="0x1" edc:name="TU16APR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR15" edc:mask="0x1" edc:name="TU16APR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x136"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APRT" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x137">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRT" edc:mask="0xff" edc:name="PRT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRT0" edc:mask="0x1" edc:name="PRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT1" edc:mask="0x1" edc:name="PRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT2" edc:mask="0x1" edc:name="PRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT3" edc:mask="0x1" edc:name="PRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT4" edc:mask="0x1" edc:name="PRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT5" edc:mask="0x1" edc:name="PRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT6" edc:mask="0x1" edc:name="PRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT7" edc:mask="0x1" edc:name="PRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16APRT0" edc:mask="0x1" edc:name="TU16APRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT1" edc:mask="0x1" edc:name="TU16APRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT2" edc:mask="0x1" edc:name="TU16APRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT3" edc:mask="0x1" edc:name="TU16APRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT4" edc:mask="0x1" edc:name="TU16APRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT5" edc:mask="0x1" edc:name="TU16APRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT6" edc:mask="0x1" edc:name="TU16APRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT7" edc:mask="0x1" edc:name="TU16APRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16APR24" edc:mask="0x1" edc:name="TU16APR24" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR25" edc:mask="0x1" edc:name="TU16APR25" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR26" edc:mask="0x1" edc:name="TU16APR26" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR27" edc:mask="0x1" edc:name="TU16APR27" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR28" edc:mask="0x1" edc:name="TU16APR28" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR29" edc:mask="0x1" edc:name="TU16APR29" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR30" edc:mask="0x1" edc:name="TU16APR30" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR31" edc:mask="0x1" edc:name="TU16APR31" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TU16ACLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="TU16ACLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x138">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16ACLK0" edc:mask="0x1" edc:name="TU16ACLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK1" edc:mask="0x1" edc:name="TU16ACLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK2" edc:mask="0x1" edc:name="TU16ACLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK3" edc:mask="0x1" edc:name="TU16ACLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK4" edc:mask="0x1" edc:name="TU16ACLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TU16AERS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TU16AERS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x139">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0x3f" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS4" edc:mask="0x1" edc:name="ERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS5" edc:mask="0x1" edc:name="ERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16AERS0" edc:mask="0x1" edc:name="TU16AERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS1" edc:mask="0x1" edc:name="TU16AERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS2" edc:mask="0x1" edc:name="TU16AERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS3" edc:mask="0x1" edc:name="TU16AERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS4" edc:mask="0x1" edc:name="TU16AERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS5" edc:mask="0x1" edc:name="TU16AERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x13A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIE" edc:desc="" edc:mask="0x1" edc:name="CIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZIE" edc:desc="" edc:mask="0x1" edc:name="ZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDSEL" edc:desc="" edc:mask="0x1" edc:name="RDSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OM" edc:desc="" edc:mask="0x1" edc:name="OM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16BCIE" edc:desc="" edc:mask="0x1" edc:name="TU16BCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BZIE" edc:desc="" edc:mask="0x1" edc:name="TU16BZIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BPRIE" edc:mask="0x1" edc:name="TU16BPRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BRDSEL" edc:desc="" edc:mask="0x1" edc:name="TU16BRDSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BOPOL" edc:mask="0x1" edc:name="TU16BOPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BOM" edc:mask="0x1" edc:name="TU16BOM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCPOL" edc:mask="0x1" edc:name="TU16BCPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BON" edc:mask="0x1" edc:name="TU16BON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="TU16BCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x13B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIF" edc:desc="" edc:mask="0x1" edc:name="CIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZIF" edc:desc="" edc:mask="0x1" edc:name="ZIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="" edc:mask="0x1" edc:name="CAPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LIMIT" edc:mask="0x1" edc:name="LIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLR" edc:desc="" edc:mask="0x1" edc:name="CLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSEN" edc:desc="" edc:mask="0x1" edc:name="OSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="" edc:mask="0x1" edc:name="RUN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16BCIF" edc:mask="0x1" edc:name="TU16BCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BZIF" edc:mask="0x1" edc:name="TU16BZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPRIF" edc:mask="0x1" edc:name="TU16BPRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCAPT" edc:mask="0x1" edc:name="TU16BCAPT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BLIMIT" edc:mask="0x1" edc:name="TU16BLIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLR" edc:desc="" edc:mask="0x1" edc:name="TU16BCLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMRBOSEN" edc:desc="" edc:mask="0x1" edc:name="TMRBOSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BRUN" edc:desc="" edc:mask="0x1" edc:name="TU16BRUN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BHLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BHLT" edc:nzwidth="8" edc:por="01000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x13C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STOP" edc:mask="0x3" edc:name="STOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:mask="0x3" edc:name="RESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="START" edc:mask="0x3" edc:name="START" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CSYNC" edc:mask="0x1" edc:name="CSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOL" edc:mask="0x1" edc:name="EPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="STOP0" edc:mask="0x1" edc:name="STOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STOP1" edc:mask="0x1" edc:name="STOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET0" edc:mask="0x1" edc:name="RESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET1" edc:mask="0x1" edc:name="RESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START0" edc:mask="0x1" edc:name="START0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START1" edc:mask="0x1" edc:name="START1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BSTOP" edc:mask="0x3" edc:name="TU16BSTOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16BRESET" edc:mask="0x3" edc:name="TU16BRESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16BSTART" edc:mask="0x3" edc:name="TU16BSTART" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16BCSYNC" edc:mask="0x1" edc:name="TU16BCSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BEPOL" edc:mask="0x1" edc:name="TU16BEPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16BSTOP0" edc:mask="0x1" edc:name="TU16BSTOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BSTOP1" edc:mask="0x1" edc:name="TU16BSTOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BRESET0" edc:mask="0x1" edc:name="TU16BRESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BRESET1" edc:mask="0x1" edc:name="TU16BRESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BSTART0" edc:mask="0x1" edc:name="TU16BSTART0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BSTART1" edc:mask="0x1" edc:name="TU16BSTART1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x13D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:mask="0xff" edc:name="PS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:mask="0x1" edc:name="PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:mask="0x1" edc:name="PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:mask="0x1" edc:name="PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS3" edc:mask="0x1" edc:name="PS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS4" edc:mask="0x1" edc:name="PS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS5" edc:mask="0x1" edc:name="PS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS6" edc:mask="0x1" edc:name="PS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS7" edc:mask="0x1" edc:name="PS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BPS0" edc:mask="0x1" edc:name="TU16BPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS1" edc:mask="0x1" edc:name="TU16BPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS2" edc:mask="0x1" edc:name="TU16BPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS3" edc:mask="0x1" edc:name="TU16BPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS4" edc:mask="0x1" edc:name="TU16BPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS5" edc:mask="0x1" edc:name="TU16BPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS6" edc:mask="0x1" edc:name="TU16BPS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS7" edc:mask="0x1" edc:name="TU16BPS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16BPS" edc:mask="0xff" edc:name="TU16BPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
