garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM1CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x154">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0xf" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM1LDS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM1LDS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x155">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:mask="0xf" edc:name="LDS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LDS0" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS1" edc:mask="0x1" edc:name="LDS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS2" edc:mask="0x1" edc:name="LDS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS3" edc:mask="0x1" edc:name="LDS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM1PR" edc:desc="" edc:name="PWM1PR" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x156">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1PRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x156">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1PRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x157">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1CPRE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1CPRE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x158">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPRE" edc:mask="0xff" edc:name="CPRE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PIPOS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1PIPOS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x159">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIPOS" edc:mask="0xff" edc:name="PIPOS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWM1GIR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWM1GIR" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x15A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1P1IF" edc:mask="0x1" edc:name="S1P1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1P2IF" edc:mask="0x1" edc:name="S1P2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWM1GIE" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWM1GIE" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x15B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1P1IE" edc:mask="0x1" edc:name="S1P1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1P2IE" edc:mask="0x1" edc:name="S1P2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="PWM1CON" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="PWM1CON" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x15C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERSNOW" edc:mask="0x1" edc:name="ERSNOW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERSPOL" edc:mask="0x1" edc:name="ERSPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:mask="0x1" edc:name="LD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="PWM1S1CFG" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="PWM1S1CFG" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x15D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x7" edc:name="MODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PPEN" edc:mask="0x1" edc:name="PPEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="POL1" edc:mask="0x1" edc:name="POL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POL2" edc:mask="0x1" edc:name="POL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
