garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB0" edc:desc="I2C ADDRESS BUFFER  REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB1" edc:desc="I2C ADDRESS BUFFER  REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR0" edc:desc="I2C ADDRESS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR0" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR1" edc:desc="I2C ADDRESS REGISTER 1" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111-" edc:name="I2C1ADR1" edc:nzwidth="8" edc:por="1111111-" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR2" edc:desc="I2C ADDRESS REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR2" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR3" edc:desc="I2C ADDRESS REGISTER 3" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111-" edc:name="I2C1ADR3" edc:nzwidth="8" edc:por="1111111-" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1BTO" edc:desc="I2C BUS TIME OUT SELECTION REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1BTO" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOTIME" edc:mask="0x3f" edc:name="TOTIME" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="TOBY32" edc:mask="0x1" edc:name="TOBY32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOREC" edc:mask="0x1" edc:name="TOREC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TOTIME0" edc:mask="0x1" edc:name="TOTIME0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME1" edc:mask="0x1" edc:name="TOTIME1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME2" edc:mask="0x1" edc:name="TOTIME2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME3" edc:mask="0x1" edc:name="TOTIME3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME4" edc:mask="0x1" edc:name="TOTIME4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME5" edc:mask="0x1" edc:name="TOTIME5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1BAUD" edc:desc="I2C BAUD RATE PRESCALER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1BAUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BAUD" edc:mask="0xff" edc:name="BAUD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I2C1CLK" edc:desc="I2C CLOCK SELECTION REGISTER" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I2C1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1F9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0xf" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2CCLK" edc:mask="0xf" edc:name="I2CCLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CCLK0" edc:mask="0x1" edc:name="I2CCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK1" edc:mask="0x1" edc:name="I2CCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK2" edc:mask="0x1" edc:name="I2CCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK3" edc:mask="0x1" edc:name="I2CCLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
