garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCLK" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCLK" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x236">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3f" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS3" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS4" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS5" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x3f" edc:name="ADCS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS5" edc:mask="0x1" edc:name="CS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ADCG1A" edc:desc="ADC CHANNEL GROUP A REGISTER" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-000" edc:name="ADCG1A" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x237">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGA0" edc:mask="0x1" edc:name="CGA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA1" edc:mask="0x1" edc:name="CGA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA2" edc:mask="0x1" edc:name="CGA2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CGA4" edc:mask="0x1" edc:name="CGA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA5" edc:mask="0x1" edc:name="CGA5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x238"/>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="ADCG1C" edc:desc="ADC CHANNEL GROUP C REGISTER" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="ADCG1C" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x239">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGC0" edc:mask="0x1" edc:name="CGC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC1" edc:mask="0x1" edc:name="CGC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CGC3" edc:mask="0x1" edc:name="CGC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC4" edc:mask="0x1" edc:name="CGC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC5" edc:mask="0x1" edc:name="CGC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC6" edc:mask="0x1" edc:name="CGC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC7" edc:mask="0x1" edc:name="CGC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x23A"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x23B"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x23C"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x3" edc:beginaddr="0x0300" edc:endaddr="0x0400" edc:regionid="sfr3">
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="PMD0" edc:desc="" edc:impl="0x24" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PMD0" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x300">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA1MD" edc:desc="" edc:mask="0x1" edc:name="DMA1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA2MD" edc:desc="" edc:mask="0x1" edc:name="DMA2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA3MD" edc:mask="0x1" edc:name="DMA3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4MD" edc:desc="" edc:mask="0x1" edc:name="DMA4MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CRCMD" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANMD" edc:desc="" edc:mask="0x1" edc:name="SCANMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYSCMD" edc:desc="" edc:mask="0x1" edc:name="SYSCMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x301">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACTMD" edc:desc="" edc:mask="0x1" edc:name="ACTMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORTWMD" edc:desc="" edc:mask="0x1" edc:name="PORTWMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCMD" edc:desc="" edc:mask="0x1" edc:name="IOCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRMD" edc:desc="" edc:mask="0x1" edc:name="CLKRMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR0MD" edc:desc="" edc:mask="0x1" edc:name="TMR0MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0xbe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x302">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TU16AMD" edc:desc="" edc:mask="0x1" edc:name="TU16AMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BMD" edc:desc="" edc:mask="0x1" edc:name="TU16BMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1MD" edc:mask="0x1" edc:name="PWM1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2MD" edc:mask="0x1" edc:name="PWM2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MD" edc:desc="" edc:mask="0x1" edc:name="CWG1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC1MD" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x303">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC3MD" edc:desc="" edc:mask="0x1" edc:name="CLC3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC4MD" edc:desc="" edc:mask="0x1" edc:name="CLC4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I3C1MD" edc:mask="0x1" edc:name="I3C1MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnn-" edc:cname="PMD4" edc:desc="" edc:impl="0x4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0u0-" edc:name="PMD4" edc:nzwidth="8" edc:por="----0x0-" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x304">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FVRMD" edc:desc="" edc:mask="0x1" edc:name="FVRMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDMD" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xD" edc:_addr="0x305"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RC0FEAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00100000" edc:name="RC0FEAT" edc:nzwidth="8" edc:por="00100000" edc:_addr="0x312">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYSBUF" edc:mask="0x7" edc:name="SYSBUF" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="I3CBUF" edc:mask="0x7" edc:name="I3CBUF" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RC1FEAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00100000" edc:name="RC1FEAT" edc:nzwidth="8" edc:por="00100000" edc:_addr="0x313">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYSBUF" edc:mask="0x7" edc:name="SYSBUF" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="I3CBUF" edc:mask="0x7" edc:name="I3CBUF" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x314"/>
        <edc:SFRDef edc:access="nn----nn" edc:cname="RC4FEAT" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu----uu" edc:name="RC4FEAT" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x315">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYSBUF" edc:mask="0x3" edc:name="SYSBUF" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="RC5FEAT" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="RC5FEAT" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x316">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYSBUF" edc:mask="0x3" edc:name="SYSBUF" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
