garyPenhook/PIC-Assembler/edc/PIC18F04Q20.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN3" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN3" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x49E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN4" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN4" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x49F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN5" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN5" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x4A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN6" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN6" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x4A1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN7" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN7" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x4A2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PORTWCLK" edc:desc="Virtual Port Control Register" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PORTWCLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x4A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWCLK" edc:mask="0x1f" edc:name="PWCLK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTWDF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTWDF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x4A4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DF0" edc:desc="" edc:mask="0x1" edc:name="DF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF1" edc:desc="" edc:mask="0x1" edc:name="DF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF2" edc:desc="" edc:mask="0x1" edc:name="DF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF3" edc:desc="" edc:mask="0x1" edc:name="DF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF4" edc:desc="" edc:mask="0x1" edc:name="DF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF5" edc:desc="" edc:mask="0x1" edc:name="DF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF6" edc:desc="" edc:mask="0x1" edc:name="DF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF7" edc:desc="" edc:mask="0x1" edc:name="DF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWDF0" edc:desc="" edc:mask="0x1" edc:name="PWDF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF1" edc:desc="" edc:mask="0x1" edc:name="PWDF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF2" edc:mask="0x1" edc:name="PWDF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF3" edc:desc="" edc:mask="0x1" edc:name="PWDF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF4" edc:mask="0x1" edc:name="PWDF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF5" edc:mask="0x1" edc:name="PWDF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF6" edc:mask="0x1" edc:name="PWDF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF7" edc:mask="0x1" edc:name="PWDF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DF" edc:mask="0xff" edc:name="DF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PWDF" edc:mask="0xff" edc:name="PWDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="PORTWCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PORTWCON" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x4A5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="" edc:mask="0x1" edc:name="CLKEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------r" edc:cname="MVIOSTAT" edc:desc="MVIO STATUS REGISTER" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u" edc:name="MVIOSTAT" edc:nzwidth="8" edc:por="-------u" edc:_modsrc="DOS-0xxxx_io_multiv_ctrl_pic_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4A6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VDDIO2RDY" edc:mask="0x1" edc:name="VDDIO2RDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x31" edc:_addr="0x4A7"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="STATUS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="STATUS" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0x4D8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
